[
    {
        "id": 1,
        "name": "Mercury",
        "image": "http://cms.ipressroom.com.s3.amazonaws.com/173/files/20146/53d0396e299b5059f6001964_Mercury+%28enhanced+color+image%2C+based+on+MESSENGER+measurements%2C+credit+NASA%29/Mercury+%28enhanced+color+image%2C+based+on+MESSENGER+measurements%2C+credit+NASA%29_1875e677-1471-4a45-ae88-e650fbd5d07a-prv.jpg",
        "moons": "0",
        "revolution": "88 days",
        "rotation": "1407.6 hours (58.6 days)",
        "diameter": "3031.67 mi",
        "average_temperature": "-297°F to 800°F",
        "cool_facts": "Mars is home to the tallest mountain in the solar system. Olympus Mons, a shield volcano, is 21km high and 600km in diameter. Despite having formed over billions of years, evidence from volcanic lava flows is so recent many scientists believe it could still be active."
      },

      {
        "id": 2,
        "name": "Venus",
        "image": "https://solarsystem.nasa.gov/system/stellar_items/list_view_images/2_mercury_480x320_new.jpg",
        "moons": "0",
        "revolution": "225 days",
        "rotation": "-5832.5 hours (243 days)",
        "diameter": "7521 mi",
        "average_temperature": "896°F",
        "cool_facts": "Many scientists believe water once existed on the surface. Future Venus explorers will search for evidence of an ancient ocean. More than 40 spacecraft have explored Venus. The ‘90s Magellan mission mapped the planet's surface and Akatsuki is currently orbiting Venus. Venus’ extreme temperatures and acidic clouds make it an unlikely place for life as we know it."
      },

      {
        "id": 3,
        "name": "Earth",
        "image": "http://www.nasa.gov/centers/goddard/images/content/638831main_globe_east_2048.jpg",
        "moons": "1",
        "revolution": "365.24 days",
        "rotation": "23.9 hours (.99 days)",
        "diameter": "7900 mi",
        "average_temperature": "57°F",
        "cool_facts":  "The earth moves around the sun at 67,000 miles per hour. Earth may once have had two moons. A teensy second moon — spanning about 750 miles (1,200 km) wide — may have orbited Earth before it catastrophically slammed into the other one. Bonus fact: At the equator, you would weigh less than if standing at one of the poles."
      },


      {
        "id": 4,
        "name": "Mars",
        "image": "https://cnet3.cbsistatic.com/img/CA_2Hfa3B5cgTeLPM33Gvu3EhyQ=/370x0/2018/07/23/b89b1f8b-a888-4f86-832e-44b1458321fc/nasa40-bloodmoon.jpg",
        "moons": "2",
        "revolution": "687 days (1.9 years)",
        "rotation": "24.6 hours (1.3 days)",
        "diameter": "4212.274 mi",
        "average_temperature": "-81°F",
        "cool_facts": "Mars is one of the most explored bodies in our solar system, and it's the only planet where we've sent rovers to roam the alien landscape. These robotic explorers have found lots of evidence that Mars was much wetter and warmer, with a thicker atmosphere, billions of years ago. Mars is known as the Red Planet because iron minerals in the Martian soil oxidize, or rust, causing the soil and atmosphere to look red."
        
      },


      {
        "id": 5,
        "name": "Jupiter",
        "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/02/11/jupiter-red-spot.jpg?w968h681",
        "moons": "79",
        "revolution": "4,332.59 days (11.9 years)",
        "rotation": "9.9 hours",
        "diameter": "83,082.3 mi",
        "average_temperature": "-234°F",
        "cool_facts": "Jupiter's Great Red Spot is a gigantic storm that’s about twice the size of Earth and has raged for over a century Jupiter cannot support life as we know it. But some of Jupiter's moons have oceans beneath their crusts that might support life. Nine spacecraft have visited Jupiter. Seven flew by and two have orbited the gas giant. Juno, the most recent, arrived at Jupiter in 2016."
        
      },

      {
        "id": 6,
        "name": "Saturn",
        "image": "https://nssdc.gsfc.nasa.gov/planetary/image/saturn.jpg",
        "moons": "62",
        "revolution": "10,759 days (29.5 years)",
        "rotation": "10.7 hours",
        "diameter": "67560.447 mi",
        "average_temperature": "-288°F",
        "cool_facts": "Saturn is a gas-giant planet and therefore does not have a solid surface like Earth’s. But it might have a solid core somewhere in there. Few missions have visited Saturn: Pioneer 11 and Voyagers 1 and 2 flew by; But Cassini orbited Saturn 294 times from 2004 to 2017."
        
      },

      {
        "id": 7,
        "name": "Uranus",
        "image": "https://solarsystem.nasa.gov/system/stellar_items/image_files/69_feature_1600x900_uranus_new.jpg",
        "moons": "27",
        "revolution": "30,688.5 days (84 years)",
        "rotation": "-17.2 hours",
        "diameter": "31,035 mi",
        "average_temperature": "-357°F",
        "cool_facts": "Uranus is an ice giant. Most of its mass is a hot, dense fluid of icy materials – water, methane and ammonia – above a small rocky core. Voyager 2 is the only spacecraft to fly by Uranus. No spacecraft has orbited this distant planet to study it at length and up close. Like Venus, Uranus rotates east to west. But Uranus is unique in that it rotates on its side Uranus' unique sideways rotation makes for weird seasons. The planet's north pole experiences 21 years of nighttime in winter, 21 years of daytime in summer and 42 years of day and night in the spring and fall."
        
      },

      {
        "id": 8,
        "name": "Neptune",
        "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/06/14/neptune-planet-space.jpg?w968h681",
        "moons": "14",
        "revolution": "60,182 days (168.4 years)",
        "rotation": "-16.11 hours",
        "diameter": "30,598.8 mi",
        "average_temperature": "-373°F",
        "cool_facts": "It is the windiest planet. Winds whip clouds of frozen methane across the planet at speeds of more than 2,000 km/h -1,200 mph—close to the top speed of a U.S. Navy F/A-18 Hornet fighter jet. Earth's most powerful winds hit only about 400 km/h (250 mph). NASA's Voyager 2 is the only spacecraft to have visited Neptune up close. It flew past in 1989 on its way out of the solar system. Because of dwarf planet Pluto’s elliptical orbit, Pluto is sometimes closer to the Sun (and us) than Neptune is."
        
      },


      {
        "id": 9,
        "name": "Pluto (Dwarf Planet)",
        "image": "https://planetary.s3.amazonaws.com/assets/images/9-small-bodies/2015/20151106_crop_p_color2_enhanced_release-superenhanced-2k-dc-ir-zld.png",
        "moons": "5",
        "revolution": "90,560 days (248 years)",
        "rotation": "-153.3 hours",
        "diameter": "1,476.8 mi",
        "average_temperature": "-378°F",
        "cool_facts": "A planet must orbit the sun, be large enough so that its own gravity molds it into a spherical shape, and it must have an orbit free of other small objects. Unfortunately for Pluto, our one-time “ninth planet” failed to meet the third condition and was downgraded to a 'dwarf planet' Because of dwarf planet Pluto’s elliptical orbit, Pluto is sometimes closer to the Sun (and us) than Neptune is."
      },  

      {
        "id": 10,
        "name": "Sun",
        "image": "http://solarviews.com/raw/vss/VSS00031.jpg",
        "moons": "0",
        "revolution": false,
        "rotation": false,
        "diameter": "2,715,395 mi",
        "average_temperature": "9,941°F (surface temperature)",
        "cool_facts": "The Sun is 4.6 billion years old. When all the Hydrogen has been burned, the Sun will continue for about 130 million more years, burning Helium, during which time it will expand to the point that it will engulf Mercury and Venus and the Earth. At this stage it will have become a red giant."
      },

      {
        "id": 11,
        "name": "Moon",
        "image": "https://thumbs-prod.si-cdn.com/CWSJLq_yzcmQyFB5A4jfcU8YLvg=/800x600/filters:no_upscale()/https://public-media.si-cdn.com/filer/ca/05/ca055340-355c-4d62-bdf7-3c79c947b327/moonmoon_moon.jpg",
        "moons": "0",
        "revolution": "27.32 days (Revolves around Earth",
        "rotation":  "27" ,
        "diameter": "1,079.6 mi",
        "average_temperature": "As low as -280°F  when sun is down,  up to 260°F when sun is up",
        "cool_facts": "The Moon is a dusty ball of rock that is roughly a quarter of the size of Earth.  It has mountains, huge craters, and flat planes called 'seas' that ar emade of hardened lava. The moon is Earth's only satellite (a celestial body that orbits a planet)  Although the Moon shines bright in the night sky, it doesn’t produce its own light. We see the Moon because it reflects light from the Sun.  Ever noticed how the Moon appears to change shape each night? That’s because as the Moon orbits the Earth, the Sun lights up different parts of its surface – so it’s just our view of the Moon that’s changing, not the Moon itself. On July 20, 1969, Neil Armstrong became the first human to step on the moon. "
      }

      
      

]